Repository: thiemonagel/partman-crypto
Catalog: debian/po/*.po
Languages: bg, ku, pa_in

source: physical volume for encryption
bg: физически том за шифриране
pa_in: ਇੰਨਕ੍ਰਿਪਸ਼ਨ ਲਈ ਭੌਤਿਕ ਵਾਲੀਅਮ

source: not active
bg: неактивен
ku: neçalak
pa_in: ਸਰਗਰਮ ਨਹੀਂ

source: Encryption method:
bg: Метод на шифриране:

source: Encryption method for this partition:
bg: Шифриране на този дял:

source: Encryption:
bg: Шифриране:
ku: Şifrekirin:
pa_in: ਇੰਨਕ੍ਰਿਪਸ਼ਨ:

source: Encryption for this partition:
bg: Шифриране за този дял:
ku: Şîfrekirina ji bo vê dabeşê:
pa_in: ਇਸ ਭਾਗ ਲਈ ਇੰਨਕ੍ਰਿਪਸ਼ਨ:

source: Key size:
bg: Големина на ключ:
ku: Mezinahiya mifteyê:
pa_in: ਕੁੰਜੀ ਅਕਾਰ:

source: Key size for this partition:
bg: Големина на ключ за този дял:
ku: Mezinahiya mifteya ji bo vê dabeşê:
pa_in: ਇਸ ਭਾਗ ਲਈ ਕੁੰਜੀ ਅਕਾਰ:

source: IV algorithm:
bg: Алгоритъм за ИВ:

source: Initialization vector generation algorithm for this partition:
bg: Алгоритъм за създаване на инициализационен вектор за този дял:

source: Different algorithms exist to derive the initialization vector for each sector. This choice influences the encryption security. Normally, there is no reason to change this from the recommended default, except for compatibility with older systems.
bg: Съществуват различни алгоритми за получаване на инициализационния вектор (ИВ) за всеки сектор. От избора на алгоритъм за ИВ зависи сигурността на шифрирането. Обикновено алгоритъмът, който се предлага по подразбиране е подходящ, освен ако се търси съвместимост със стари системи.

source: Encryption key:
bg: Ключ за шифриране:
ku: Mifteya şîfrekirinê:
pa_in: ਇੰਨਕ੍ਰਿਪਸ਼ਨ ਕੁੰਜੀ:

source: Type of encryption key for this partition:
bg: Вид на шифриращия ключ за този дял:
ku: Cureyê mifteya şîfrekirina vê dabeşê:
pa_in: ਇਸ ਭਾਗ ਲਈ ਫਾਇਲ ਇੰਨਕ੍ਰਿਪਸ਼ਨ ਕਿਸਮਮ:

source: Encryption key hash:
bg: Хеш на ключа:

source: Type of encryption key hash for this partition:
bg: Вид на хеша на шифриращия ключ за този дял:

source: The encryption key is derived from the passphrase by applying a one-way hash function to it. Normally, there is no reason to change this from the recommended default and doing so in the wrong way can reduce the encryption strength.
bg: Шифриращият ключ се получава чрез прилагане на еднопосочна хешираща функция към въведената парола. Промяната на предложения по подразбиране метод може да доведе до намаляване на ефективността на шифрирането.

source: Erase data:
bg: Изтриване на данните:

source: no
bg: не

source: yes
bg: да

source: Erase data on this partition
bg: Изтриване на данните на този дял

source: Really erase the data on ${DEVICE}?
bg: Наистина ли да бъдат изтрити данните на ${DEVICE}?

source: The data on ${DEVICE} will be overwritten with random data. It can no longer be recovered after this step has completed. This is the last opportunity to abort the erase.
bg: Данните на ${DEVICE} ще бъдат презаписани със случайни числа. След тазиоперация първоначалните данни не могат да бъдат възстановени. Това е последната Ви възможност да откажете изтриването.

source: Erasing data on ${DEVICE}
bg: Изтриване на ${DEVICE}

source: Erasing data on ${DEVICE} failed
bg: Грешка при изтриването на данните на ${DEVICE}

source: An error occurred trying to erase the data on ${DEVICE}. The data has not been erased.
bg: Появи се проблем при опита за изтриване на данните на ${DEVICE}. Данните не са изтрити.

source: Setting up encryption...
bg: Настройване на шифриране...
ku: Şîfrekirinê saz dike...
pa_in: ਇੰਨਕ੍ਰਿਪਸ਼ਨਖਵਾਂ ਨਿਤਧਾਰਨ ਕਰ ਰਿਹਾ ਹੈ...

source: Configure encrypted volumes
bg: Настройване на шифрирани томове
ku: Volumên şifrekirî saz bike
pa_in: ਇੰਨਕ੍ਰਿਪਟਡ ਵਾਲੀਅਮ ਕ ਸੰਰਚਨਾ ਕਰੋ

source: No partitions to encrypt
bg: Няма дялове за шифриране
ku: Dabeşên bên şîfrekirin tune
pa_in: ਇੰਨਕ੍ਰਿਪਟ ਕਰਨ ਲਈ ਕੋਈ ਭਾਗ ਨਹੀਂ

source: No partitions have been selected for encryption.
bg: Не са избрани дялове за шифриране.
ku: Dabeşên bên şîfrekirin nehatin hilbijartin.
pa_in: ਇੰਨਕ੍ਰਿਪਸ਼ਨੇਸ਼ਨ ਲਈ ਕਭਾਗਪੈਕੇਜ ਨਹੀਂ ਚੁਣਿਆ।

source: Required programs missing
bg: Липсват изисквани програми
ku: Bernameyên pêwîst ne amade ne
pa_in: ਲੋੜੀਂਦਾ ਪਰੋਗਰਾਮ ਗੁੰਮ ਹੈ

source: This build of debian-installer does not include one or more programs that are required for partman-crypto to function correctly.
bg: Това издание на debian-installer не включва една или повече програми, които са необходими на partman-crypto за правилно функциониране.

source: Required encryption options missing
bg: Липсват изисквани опции за шифриране
ku: Mîhengên şîfrekirinê yên pêwîst ne amade ne
pa_in: ਲੋੜੀਂਦੀ ਇੰਨਕ੍ਰਿਪਸ਼ਨ ਚੋਣ ਗੁੰਮ ਹੈ

source: The encryption options for ${DEVICE} are incomplete. Please return to the partition menu and select all required options.
bg: Опциите за шифриране на ${DEVICE} са непълни. Моля, върнете се към менюто за манипулиране на дялове и изберете всички необходими опции.
ku: Mîhengên şîfrekirinê yên ${DEVICE}·ne temam in. Ji kerema xwe bizivire menuya dabeşkirinê û mîhengên pêwîst hilbijêre.
pa_in: ${DEVICE} ਲਈ ਇੰਨਕ੍ਰਿਪਸ਼ਨ ਚੋਣ ਅਧੂਰੀ ਹੈ। ਕਿਰਪਾ ਕਰਕੇ ਵਿਭਾਗ ਮੇਨੂ ਵਿੱਚ ਜਾਓ ਅਤੇ ਸਭ ਲੋੜੀਂਦੀਆਂ ਚੋਣਾਂ ਚੁਣੋ।

source: missing
bg: липсва
ku: neamade
pa_in: ਗੁੰਮ ਹੈ

source: In use as physical volume for encrypted volume ${DEV}
bg: Използва се като физически том за шифрирания том ${DEV}

source: Encryption package installation failure
bg: Грешка при инсталирането на пакет за шифриране
ku: Çewtiya sazkirina paketa şîfrekirinê
pa_in: ਇੰਨਕ੍ਰਿਪਸ਼ਨ ਪੈਕੇਜ ਇੰਸਟਾਲੇਸ਼ਨ ਅਸਫਲਤਾ

source: The kernel module package ${PACKAGE} could not be found or an error occurred during its installation.
bg: Пакетът с модул(и) на ядро ${PACKAGE} не може да бъде намерен или се е получила грешка по време на инсталацията.

source: It is likely that there will be problems setting up encrypted partitions when the system is rebooted. You may be able to correct this by installing the required package(s) later on.
bg: Вероятно ще има проблеми по време на начално зареждане, когато системата се опита да настрои шифрирани дялове. Възможно е да ги поправите чрез инсталиране на необходимите пакети по-късно.

source: Write the changes to disk and configure encrypted volumes?
bg: Записване на промените на диска и настройване на шифрирани томове?

source: Before encrypted volumes can be configured, the current partitioning scheme has to be written to disk. These changes cannot be undone.
bg: Преди шифрираните томове да може да бъдат настроени, текущата схема на разделянето трябва да бъде записана на диска. Тези промени не могат да бъдат отменени по-късно.
ku: Berê sazkirina volumên şîfrekirî, divê şablona dabeşkirinê bê nivîsandin diskê. Ev guherandin nayên bizivirandin paşê.
pa_in: ਇੰਨਕ੍ਰਿਪਟਡ ਵਾਲੀਅਮ ਸੰਰਚਿਤ ਕਰਨ ਤੋਂ ਪਹਿਲਾਂ, ਮੌਜੂਦਾ ਵਿਭਾਗੀਕਰਨ ਸਕੀਮ ਡਿਸਕ ਤੇ ਲਿਖੀ ਹੋਵੇ। ਇਹ ਤਬਦੀਲੀਆਂ ਰੱਦ ਨਹੀਂ ਕੀਤੀਆਂ ਜਾ ਸਕਦੀਆਂ।

source: Keep current partition layout and configure encrypted volumes?
bg: Записване на разположението на дяловете и настройване на шифрирани томове?
pa_in: ਮੌਜੂਦਾ ਭਾਗ ਖਾਕਾ ਰੱਖੋ ਅਤੇ ਇੰਨਕ੍ਰਿਪਟਡ ਵਾਲੀਅਮ ਸੰਰਚਿਤ ਕਰੋ?

source: After the encrypted volumes have been configured, no additional changes to the partitions on the disks containing encrypted volumes are allowed. Please decide if you are satisfied with the current partitioning scheme for these disks before continuing.
bg: След като шифрираните томове са вече настроени, не са позволени допълнителни промени на дяловете в дисковете, съдържащи шифрирани томове. Моля, решете дали текущата схема на разделянето е задоволителна преди да продължите.

source: Configuration of encrypted volumes failed
bg: Грешка при настройване на шифрирани томове

source: An error occurred while configuring encrypted volumes.
bg: Грешка при настройване на шифрирани томове.
ku: Çewtiya sazkirina volumên şîfrekirî derket holê.
pa_in: ਇੰਨਕ੍ਰਿਪਟਡ ਵਾਲੀਅਮ ਸੰਰਚਨਾਲਿਖਣ ਸਮੇਂ ਗਲਤੀ ਹੋਈ ਹੈ।

source: The configuration has been aborted.
bg: Настройката е прекъсната.

source: Initialisation of encrypted volume failed
bg: Грешка при създаването на шифриран том

source: An error occurred while setting up encrypted volumes.
bg: Получена е грешка по време на настройване на шифрирани томове.
ku: Di sazkirina volumên şîfrekirî çewtiyek derket holê.
pa_in: ਇੰਨਕ੍ਰਿਪਟਡ ਵਾਲੀਅਮ ਨਿਰਧਾਰਨ ਲਿਖਣ ਸਮੇਂ ਗਲਤੀ ਹੋਈ ਹੈ।

source: Passphrase
bg: Парола
ku: Hevoka şîfreyê
pa_in: ਸ਼ਬਦ

source: Keyfile (GnuPG)
bg: Файл с ключ (GnuPG)
ku: Dosiya mifteyan (GnuPG)
pa_in: ਕੁੰਜੀ-ਫਾਇਲ (GnuPG)

source: Random key
bg: Случаен ключ
ku: Mifteya tesadufî
pa_in: ਲਗਾਤਾਰ ਕੁੰਜੀ

source: Unsafe swap space detected
bg: Открито е незащитено място за виртуална памет
ku: Cihê swap a ne ewlekar hat dîtin
pa_in: ਨਾ-ਸੁਰੱਖਿਅਤ ਸਵੈਪ ਸਪੇਸ ਲੱਭੀ ਹੈ

source: An unsafe swap space has been detected.
bg: Открито е незащитено място за виртуална памет.
ku: Cihê swap a ne ewlekar hat dîtin.
pa_in: ਇੱਕ ਨਾ-ਸੁਰੱਖਿਅਤ ਸਪੇਸ ਲੱਭੀ ਹੈ।

source: This is a fatal error since sensitive data could be written out to disk unencrypted. This would allow someone with access to the disk to recover parts of the encryption key or passphrase.
bg: Това е фатална грешка, тъй като позволява на диска да бъдат записвани нешифрирани данни. Това би позволило на хора с достъп до диска да се доберат до части от шифриращи ключове или пароли.
pa_in: ਇਹ ਘਾਤਕ ਗਲਤੀ ਹੈ ਕਿਉਂਕਿ ਜਰੂਰੀ ਡਾਟਾ ਨਾ-ਇੰਨਕ੍ਰਿਪਟਡ ਡਿਸਕ ਤੇ ਲਿਖਿਆ ਜਾ ਸਕਦਾ ਹੈ। ਇਸ ਨਾਲ ਕਿਸੇ ਨੂੰ ਵੀ ਇੰਨਕ੍ਰਿਪਸ਼ਨ ਕੁੰਜੀ ਜਾਂ ਸ਼ਬਦ ਦਾ ਹਿੱਸਾ ਮੁੜ ਪ੍ਰਾਪਤ ਕਰਨ ਲਈ ਡਿਸਕ ਤੱਕ ਪਹੁੰਚ ਮਿਲ ਸਕਦੀ ਹੈ।

source: Please disable the swap space (e.g. by running swapoff) or configure an encrypted swap space and then run setup of encrypted volumes again. This program will now abort.
bg: Моля, деактивирайте мястото за виртуална памет (например чрез swapoff) или настройте шифрирано място за виртуална памет и тогава пуснете отново настройване на шифрирани дялове. Тази програма сега ще прекъсне.
pa_in: ਕਿਰਪਾ ਕਰਕੇ ਸਵੈਪ ਸਪੇਸ ਨੂੰ ਅਯੋਗ ਕਰੋ (ਉਦਾਪਰਨ ਲਈ swapoff ਚਲਾ ਕੇ) ਜਾਂ ਇੱਕ ਇੰਕ੍ਰਿਪਟਡ ਸਵੈਪ ਸਪੇਸ ਸੰਰਚਿਤ ਕਰੋ ਅਤੇ ਫਿਰ ਇੰਕ੍ਰਿਪਟਡ ਵਾਲੀਅਮ ਨਿਰਧਾਰਨ ਚਲਾਓ। ਇਹ ਪਰੋਗਰਾਮ ਹੁਣ ਅਧੂਰਾ ਖਤਮ ਹੋਵੇਗਾ।

source: Encryption passphrase:
bg: Парола за шифриране:
ku: Hevoka şîfrekirinê:
pa_in: ਇੰਨਕ੍ਰਿਪਸ਼ਨ ਸ਼ਬਦ:

source: You need to choose a passphrase to encrypt ${DEVICE}.
bg: Нуждаете се от парола за шифриране на ${DEVICE}.
ku: Ji bo şîfrekirina ${DEVICE} pêwîst e tu hevokeke şîfrekirinê hilbijêrî.
pa_in: ਤੁਹਾਨੂੰ ਇੰਨਕ੍ਰਿਪਟ ${DEVICE} ਲਈ ਸ਼ਬਦ ਚੁਣਨ ਦੀ ਲੋੜ ਹੈ।

source: The overall strength of the encryption depends strongly on this passphrase, so you should take care to choose a passphrase that is not easy to guess. It should not be a word or sentence found in dictionaries, or a phrase that could be easily associated with you.
bg: Общата устойчивост на шифрирането зависи силно от тази парола, така че трябва да внимавате да изберете парола, която не е лесно да се отгатне. Не трябва да е дума или изречение, което може да се открие в речници, или фраза, която лесно може да бъде асоциирана с Вас.
pa_in: ਇੰਨਕ੍ਰਿਪਸ਼ਨ ਦੀ ਪੂਰੀ ਘਣਤਾ ਇਸ ਪਹਿਰੇ ਤੇ ਪੂਰੀ ਤਰਾਂ ਨਿਰਭਰ ਕਰਦੀ ਹੈ, ਇਸ ਕਰਕੇ ਤੁਹਾਨੂੰ ਅਜਿਹਾ ਪਹਿਰਾ ਚੁਣਨਾ ਚਾਹੀਦਾ ਹੈ ਜਿਸ ਦਾ ਅੰਦਾਜਾ ਅਸਾਨੀ ਨਾਲ ਨਾ ਲੱਗੇ। ਇਹ ਸ਼ਬਦਕੋਸ਼ ਵਿੱਚੋਂ ਕੋਈ ਸ਼ਬਦ ਜਾਂ ਵਾਕ, ਜਾਂ ਸ਼ਬਦ ਜੋ ਤੁਹਾਡੇ ਨਾਲ ਸੰਬੰਧਿਤ ਹੈ ਨਾ ਹੋਵੇਨੰਬਰ ਨਾ ਹੋਵੇ।

source: A good passphrase will contain a mixture of letters, numbers and punctuation. Passphrases are recommended to have a length of 20 or more characters.
bg: Добрата парола съдържа смесица от букви, цифри и пунктуация. Паролите за ключове е препоръчително да имат дължина 20 или повече знака.
pa_in: ਇੱਕ ਵਧੀਆ ਸ਼ਬਦ ਵਿੱਚ ਅੱਖਰਾਂ, ਅੰਕਾਂ ਅਤੇ ਵਿਸ਼ਰਾਮਾਂ ਦਾ ਮਿਸ਼ਰਣ ਹੋਵੇਗਾ। ਸ਼ਬਦ ਦੀ ਲੰਬਾਈ 20 ਜਾਂ ਜਿਆਦਾ ਅੱਖਰ ਹੋਣ ਦੀ ਸਿਫਾਰਸ਼ ਕੀਤਾ ਜਾਂਦੀ ਹੈ।

source: Re-enter passphrase to verify:
bg: Въведете наново паролата за проверка:
ku: Ji bo rastkirinê hevoka şîfrekirinê carekî din binivîse:
pa_in: ਜਾਂਚ ਲਈ ਸ਼ਬਦ ਮੁੜ ਭਰੋ:

source: Please enter the same passphrase again to verify that you have typed it correctly.
bg: Въведете отново същата парола, за да бъде проверено дали е написана правилно.
ku: Ji bo rastkirina te rast nivîsand, vê hevoka şîfrekirinê carekî din binivîse.
pa_in: ਕਿਰਪਾ ਕਰਕੇ ਜਾਂਚ ਕਰਨ ਲਈ ਕਿ ਤੁਸੀਂ ਇਹ ਠੀਕ ਲਿਖਿਆ ਹੈ ਫਿਰ ਉਹੀ ਪਹਿਰਾੁਪਤ-ਕੋਡ ਭਰੋ।

source: Passphrase input error
bg: Грешка при въвеждане на парола
ku: Çewtiya nivîsandina hevoka şîfrekirinê
pa_in: ਸ਼ਬਦ ਇੰਪੁੱਟ ਗਲਤੀ

source: The two passphrases you entered were not the same. Please try again.
bg: Двете пароли, които въведохте, не са едни и същи. Моля, опитайте отново.
ku: Her du hevokên şîfrekirinê hevdu nagirin. Ji kerema xwe carekî din biceribîne.
pa_in: ਭਰੇ ਹੋਏ ਦੋਨੋ ਪਹਿਰੇ ਇੱਕੋ ਜਿਹੇ ਨਹੀਂ ਹਨ। ਕਿਰਪਾ ਕਰਕੇ ਫਿਰ ਕੋਸ਼ਿਸ਼ ਭਰੋ।

source: Empty passphrase
bg: Празна парола
ku: Hevoka şîfreyê vala
pa_in: ਖਾਲੀ ਸ਼ਬਦ

source: You entered an empty passphrase, which is not allowed. Please choose a non-empty passphrase.
bg: Въведохте празна парола, което не е позволено. Моля, изберете непразна парола.
ku: Hevoka şîfrekirinê ya te nivîsand vala ya. Ev ne caîz e. Ji kerema xwe hevokeke ne vala hilbijêre.
pa_in: ਤੁਸੀਂ ਖਾਲੀ ਸ਼ਬਦ ਭਰਿਆ ਹੈ, ਜਿਸ ਦੀ ਮਨਜੂਰੀ ਨਹੀਂ ਹੈ।ਕਿਰਪਾ ਕਰਕੇ ਨਾ-ਖਾਲੀ ਸ਼ਬਦ ਚੁਣੋ।

source: Use weak passphrase?
bg: Използване на празна парола?
ku: Hevoka şîfreyê ya bêhêz bi kar bîne?
pa_in: ਕਮਜੋਰ ਸ਼ਬਦ ਵਰਤੋ?

source: You entered a passphrase that consists of less than ${MINIMUM} characters, which is considered too weak. You should choose a stronger passphrase.
bg: Въведохте парола, която се състои от по-малко от ${MINIMUM} знака, което се счита за твърде слаба парола. Трябва да изберете по-силна парола.
ku: Di hevoka şîfrekirina tê ji ·${MINIMUM} kêmtir tîp hene. Ji ber vê gelek lawaz e. Hevokeke şîfrekirina ye xurtir hilbijêre.
pa_in: ਤੁਸੀਂ ਸ਼ਬਦ ਭਰਿਆ ਹੈ ਜਿਸ ਵਿੱਚ ${MINIMUM} ਅੱਖਰਾਂ ਤੋਂ ਘੱਟ ਹਨ, ਜੋ ਕਮਜੋਰ ਮੰਨਿਆ ਜਾਂਦਾ ਹੈ। ਤੁਹਾਨੂੰ ਸਖਤ ਸ਼ਬਦ ਚੁਣਨਾ ਚਾਹੀਦਾ ਹੈ।

source: Enter random characters
bg: Въвеждайте случайни знаци
ku: Tîpên tesadufî binivîse
pa_in: ਲਗਾਤਾਰ ਅੱਖਰ ਭਰੋ

source: The encryption key for ${DEVICE} is now being created.
bg: Ключът за шифриране на ${DEVICE} сега е създаден.
ku: Mifteya şîfrekirinê ji bo ${DEVICE} niha tê afirandin.
pa_in: ${DEVICE} ਲਈ ਹੁਣ ਇੰਨਕ੍ਰਿਪਸ਼ਨ ਕੁੰਜੀ ਬਣ ਗਈ ਹੈ।

source: You can help speed up the process by entering random characters on the keyboard, or just wait until enough keydata has been collected. (NOTE: this can take a long time)
bg: Може да ускорите процеса чрез въвеждане на случайни знаци по клавиатурата или просто изчаквайки, докато не бъдат събрани достатъчно данни. (Заб.: това може да отнеме много време)
pa_in: ਤੁਸੀਂ ਕਾਰਜ ਦੀ ਗਤਾ ਵਧਾਉਣ ਵਿੱਚ ਕੀਬੋਰਡ ਤੇ ਲਗਾਤਾਰ ਅੱਖਰ ਭਰ ਕੇ ਮਦਦ ਕਰ ਸਕਦੇ ਹੋ, ਜਾਂ ਕੁੰਜੀ-ਡਾਟਾ ਇਕੱਠਾ ਕਰਨ ਦੀ ਉਡੀਕ ਵਿੱਚ। (ਸੂਚਨਾ: ਇਹ ਕਾਫੀ ਸਮਾਂ ਲੈ ਸਕਦਾ ਹੈ)

source: Keyfile creation failure
bg: Грешка при създаване на файл за ключ
ku: Afirandina dosiya mifteyê serneket
pa_in: ਕੁੰਜੀ-ਫਾਇਲ ਬਣਾਉਣ ਵਿੱਚ ਅਸਫਲਤਾ ਰਿਹਾ

source: An error occurred while creating the keyfile.
bg: Получена е грешка при създаване на файла за ключ.
ku: Di afirandina dosiya mifteyê de pirsgirêk derket holê.
pa_in: ਕੁੰਜੀ-ਫਾਇਲ ਬਣਾਉਣ ਸਮੇਂ ਗਲਤੀ ਵਾਪਰੀ ਹੈ।

source: You have selected the root file system to be stored on an encrypted partition. This feature is not available and continuing now would result in an installation that cannot be used.
bg: Избрахте кореновата файлова система да бъде върху шифриран дял. Тази възможност не е достъпна и продължаването сега ще доведе до неизползваема инсталация.

source: Please go back and choose a non-encrypted partition for the root file system.
bg: Моля, върнете се обратно и изберете нешифриран дял за коренова файлова система.

source: You have selected the root file system to be stored on an encrypted partition. This feature requires a separate /boot partition on which the kernel and initrd can be stored.
bg: Избрахте кореновата файлова система да бъде върху шифриран дял. Това изисква използването на отделен дял за /boot, който да съдържа ядрото и друга информация, необходима за началното зареждане на операционната система.

source: You should go back and setup a /boot partition.
bg: Трябва да се върнете назад и да настроите отделен дял за /boot.

source: Encryption configuration failure
bg: Грешка при настройване на шифриране
ku: Çewtiya sazkirina şîfrekirinê
pa_in: ਇੰਨਕ੍ਰਿਪਸ਼ਨ ਸੰਰਚਨਾ ਅਸਫਲਤਾ

source: You have selected the /boot file system to be stored on an encrypted partition. This is not possible because the boot loader would be unable to load the kernel and initrd. Continuing now would result in an installation that cannot be used.
bg: Избрахте файловата система за зареждане на операционната система да бъде върху шифриран дял. Тази възможност не е достъпна, понеже програмата за първоначално зареждане няма да може да зареди ядрото от шифриран дял. Продължаването въпреки това предупреждение ще доведе до неизползваема инсталация.

source: You should go back and choose a non-encrypted partition for the /boot file system.
bg: Моля, върнете се обратно и изберете нешифриран дял за файловата система /boot.

source: Are you sure you want to use a random key?
bg: Сигурен(-на) ли сте, че искате да използвате случаен ключ?
ku: Tû ewle yî tu dixwazî mifteyeke tesadufî bi kar bînî?
pa_in: ਕੀ ਤੁਸੀਂ ਯਕੀਨਨਣਲਗਾਤਾਰ ਕੁੰਜੀ ਵਰਤਣਾ ਨਾ ਚਾਹੁੰਦੇ ਹੋ?

source: You have chosen a random key type for ${DEVICE} but requested the partitioner to create a file system on it.
bg: Избрахте използване на случаен ключ за ${DEVICE}, но поискахте манипулирането на дялове да създаде файлова система там.

source: Using a random key type means that the partition data is going to be destroyed upon each reboot. This should only be used for swap partitions.
bg: Използването на случаен ключ означава, че данните в дяла ще бъдат унищожавани при всяко рестартиране. Тази възможност трябва да се използва само за места за виртуална памет.
ku: Bikaranîna mifteyeke tesadufî tê wateyê agahiyên dabeşê di her bootkirinê de bên tunekirin. Ev bi tenê ji bo dabeşên swap bê bi kar anîn.
pa_in: ਲਗਾਤਾਰ ਕੁੰਜੀ ਕਿਸਮ ਵਰਤਣ ਦਾ ਮਤਲਬ ਹੈ ਕਿ ਭਾਗ ਡਾਟਾ ਹਰ ਵਾਰ ਮੁੜ ਚੱਲਣ ਤੇ ਨਸ਼ਟ ਹੋ ਜਾਵੇਗਾ। ਇਸ ਸਿਰਫ ਸਵੈਪ ਭਾਗਾਂ ਲਈ ਵਰਤਣਾ ਚਾਹੀਦਾ ਹੈ।

source: Failed to download crypto components
bg: Грешка при зареждане на компонентите за шифриране

source: An error occurred trying to download additional crypto components.
bg: Грешка при опит за изтегляне на допълнителни компоненти за шифриране.

source: Proceed to install crypto components despite insufficient memory?
bg: Да бъде ли направен опит да се инсталират компонентите за шифриране, въпреки че не достига памет?

source: There does not seem to be sufficient memory available to install additional crypto components. If you choose to go ahead and continue anyway, the installation process could fail.
bg: Изглежда наличната оперативна памет е недостатъчна за зареждане на допълнителните компоненти, осигуряващи функциите за шифриране. Ако продължите въпреки това, процесът на инсталиране може да не завърши успешно.

source: Encryption type:
pa_in: ਇੰਨਕ੍ਰਿਪਸ਼ਨ ਕਿਸਮ:

source: Encryption type for this partition:
pa_in: ਇਸ ਭਾਗ ਲਈ ਇੰਨਕ੍ਰਿਪਸ਼ਨ ਕਿਸਮ:

source: This build of debian-installer does not include one or more programs that are required for partman-crypt to function correctly.
pa_in: ਡੇਬੀਅਨ-ਇੰਸਟਾਲਰ ਦੇ ਇਸ ਪੈਕੇਜ ਵਿੱਚ ਇੱਕ ਦਾਂ ਜਿਆਦਾ ਪਰੋਗਰਾਮ ਸ਼ਾਮਲ ਹਨ ਜੋ partman-crypt ਦੇ ਠੀਕ ਤਰਾਂ ਕੰਮ ਕਰਨ ਲਈ ਲੋੜੀਂਦੇ ਹਨ।

source: The kernel module package ${PACKAGE} could not be found or an error occurred during installation.
ku: Paketa modula kernel ${PACKAGE}·nehat dîtin an di sazkirinê de çewtiyek derket holê.
pa_in: ਕਰਨਲ ਮੈਡਿਊਲ ਪੈਕੇਜ ${PACKAGE} ਨਹੀਂ ਲੱਭਿਆ ਜਾਂ ਇੰਸਟਾਲੇਸ਼ਨ ਦੌਰਾਨ ਗਲਤੀ ਵਾਪਰੀ ਹੈ।

source: There will likely be problems during boot when the system tries to setup encrypted partitions. You can still correct them by installing the required package later on.
pa_in: ਉੱਥੇ ਬੂਟ ਦੌਰਾਨ ਸਮੱਸਿਆ ਹੋਵੇਗੀ ਜਦੋਂ ਸਿਸਟਮ ਇੰਨਕ੍ਰਿਪਟਡ ਭਾਗਾਂ ਨੂੰ ਨਿਰਧਾਰਤ ਕਰਨ ਦੀ ਕੋਸ਼ਿਸ਼ ਕਰੇਗਾ। ਤੁਸੀਂ ਇਸ ਨੂੰ ਬਾਅਦ ਵਿੱਚ ਲੋੜੀਂਦੇ ਪੈਕੇਜ ਇੰਸਟਾਲ ਕਰਕੇ ਠੀਕ ਕਰ ਸਕਦੇ ਹੋ।

source: Write the changes to disks and configure encrypted volumes?
ku: Guherandinê binivîse diskê û voluman şîfrekirî mîheng bike?
pa_in: ਡਿਸਕ ਤੇ ਤਬਦੀਲੀਆਂ ਲਿਖੋ ਅਤੇ ਇੰਨਕ੍ਰਿਪਟਡ ਵਾਲੀਅਮ ਸੰਰਚਿਤ ਕਰੋ?

source: After the encrypted volumes have been configured, no additional changes to the partitions in the disks containing encrypted volumes are allowed. Please decide if you are satisfied with the current partitioning scheme in these disks before continuing.
pa_in: ਇੰਨਕ੍ਰਿਪਟਡਕਲ ਵਾਲੀਅਮ ਮੈਨੇਜਰ ਸੰਰਚਿਤ ਕਰਨ ਤੋਂ ਬਾਅਦਇੰਨਕ੍ਰਿਪਟਡਿਕ ਵਾਲੀਅਮ ਵਾਲੀ ਡਿਸਕ ਤੇ ਭਾਗਾਂ ਵਿੱਚ ਕੋ ਤਬਦੀਲੀ ਨਹੀਂ ਕੀਤੀ ਨਹੀਂ ਜਾ ਸਕਦੀ। ਕਿਰਪਾ ਕਰਕੇ ਫੈਸਲਾ ਕਰੋ ਕਿ ਜਾਰੀ ਕਰਨ ਤੋਂ ਪਹਿਲਾਂ ਤੁਸੀਂ ਇਹਨਾ ਡਿਸਕਾਂ ਤੇ ਮੌਜੂਦਾ ਵਿਭਾਗੀਕਰਨ ਸਕੀਮ ਨਾਲ ਸਹਿਮਤ ਹੋ।

source: Encrypted volumes configuration failure
ku: Çewtiya sazkirina volumên şîfrekirî
pa_in: ਇੰਨਕ੍ਰਿਪਟਡ ਵਾਲੀਅਮ ਸੰਰਚਨਾ ਅਸਫਲਤਾ

source: The configuration is aborted.
ku: Sazkirin tê betalkirin.
pa_in: ਸੰਰਚਨਾ ਅਧੂਰੀ ਖਤਮ ਕੀਤੀ ਗਈ।

source: Encrypted volume initialisation failed
ku: Dan destpêkirina volumeya şîfrekirî serneket
pa_in: ਇੰਨਕ੍ਰਿਪਟਡ ਵਾਲੀਅਮ ਇੰਸਟਾਲੇਸ਼ਨ ਅਸਫਲ ਹੋਈ

source: Loopback (loop-AES)
pa_in: ਲੂਪਬੈਕ (loop-AES)

source: Device-mapper (dm-crypt)
pa_in: ਜੰਤਰ-ਮਿਲਾਣਕਾਰ (dm-crypt)

source: Device-mapper (LUKS)
pa_in: ਜੰਤਰ-ਮਿਲਾਣਕਾਰ (LUKS)

source: Enter random characters to continue
pa_in: ਜਾਰੀ ਰੱਖਣ ਲਈ ਲਗਾਤਾਰ ਅੱਖਰ ਭਰੋ

source: The encryption key for ${DEVICE} is now being created. (${PROGRESS})
pa_in: ${DEVICE} ਇੰਨਕ੍ਰਿਪਸ਼ਨ ਕੁੰਜੀ ਹੁਣ ਬਣ ਗਈ ਹੈ। (${PROGRESS})

source: You can help speed up the process by entering random data on the keyboard to fill the randomness pool and continuing once in a while. This dialog will recur until enough keydata has been collected.
pa_in: ਤੁਸੀਂ ਕਾਰਜ ਦੀ ਗਤਾ ਵਧਾਉਣ ਵਿੱਚ ਲਗਾਤਾਰਤਾ ਪੂਲ ਭਰਨ ਲਈ ਅਤੇ ਜਾਰੀ ਰਹਿਣ ਲਈ ਕੀਬੋਰਡ ਤੇ ਲਗਾਤਾਰ ਡਾਟਾ ਭਰ ਕੇ ਮਦਦ ਕਰ ਸਕਦੇ ਹੋ। ਇਹ ਵਾਰਤਾਲਾਪ ਜਾਰੀ ਰਹੇਗੀ ਜਦੋਂ ਤੱਕ ਲੋੜੀਂਦਾ ਡਾਟਾ ਇਕੱਠਾ ਨਹੀਂ ਹੁੰਦਾ।

source: This process requires the system to have large amounts of collected randomness ("entropy"), of which there is likely too little at this stage of the installation.
pa_in: ਇਸ ਕਾਰਜ ਲਈ ਸਿਸਟਮ ਕੋਲ ਵੱਡੀ ਮਾਤਰਾ ਵਿੱਚ ਇਕੱਠੀ ਕੀਤੀ ਲਗਾਤਾਰਤਾ ("entropy") ਦੀ ਲੋੜ ਹੈ, ਜਿਸ ਵਿੱਚੋਂ ਕੁਝ ਇੰਸਟਾਲੇਸ਼ਨ ਲਈ ਜਰੂਰੀ ਹੈ।

source: You have selected the root filesystem to be stored on an encrypted partition. This feature is not available and continuing now would result in an installation that cannot be used.
pa_in: ਤੁਸੀਂ ਰੂਟ ਫਾਇਸ ਸਿਸਟਮ ਨੂੰ ਇੰਨਕ੍ਰਿਪਟਡ ਭਾਗ ਉੱਪਰ ਸੰਭਾਲਣ ਲਈ ਚੁਣਿਆ ਹੈ। ਇਹ ਸਹੂਲਤ ਉਪਲੱਬਧ ਨਹੀਂ ਅਤੇ ਹੁਣ ਜਾਰੀ ਹੋ ਰਹੀ ਹੈ ਇਸ ਦਾ ਨਤੀਜਾ ਇੰਸਟਾਲੇਸ਼ਨ ਹੈ ਜੋ ਵਰਤੀ ਨਹੀਂ ਜਾ ਸਕਦੀ।

source: Please go back and choose a non-encrypted partition for the root filesystem.
ku: Ji kerema xwe bizivire û ji bo pergala dosiyan root dabeşeke neşîfrekirî hilbijêre.
pa_in: ਕਿਰਪਾ ਕਰਕੇ ਪਿੱਛੇ ਜਾਓ ਅਤੇ ਰੂਟ ਫਾਇਲ ਸਿਸਟਮ ਲਈ ਨਾ-ਇੰਨਕ੍ਰਿਪਟਡ ਭਾਗ ਚੁਣੋ।

source: You have chosen a random key type for ${DEVICE} but requested the partitioner to create a filesystem on it.
pa_in: ਤੁਸੀਂ ${DEVICE} ਲਈ ਲਗਾਤਾਰ ਕੁੰਜੀ ਚੁਣੀ ਹੈ ਪਰ ਇਸ ਉੱਪਰ ਫਾਇਲ ਸਿਸਟਮ ਬਣਾਉਣ ਲਈ ਵਿਭਾਗੀਕਰਨ ਕਰਤਾ ਨੂੰ ਬੇਨਤੀ ਕੀਤੀ ਹੈ।
